Public Member Functions | Friends | List of all members
ACAPI::v1::DesignOptionCombination Class Reference
Design Options
A class that represents the design option combination of the view settings. More...
#include <DesignOptionCombination.hpp>
 Inheritance diagram for ACAPI::v1::DesignOptionCombination:
 Public Member Functions
GS::UniString  | GetName () const
GS::Guid  | GetGuid () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
const API_Token &  | GetToken () const
 Friends
class  | Impl::DesignOptionCombinationViewSettingsImpl
class  | DesignOptionManager
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
 Protected Attributes inherited from ACAPI::v1::Object
std::shared_ptr< Impl::ObjectImpl >  | mImpl
Detailed Description
A class that represents the design option combination of the view settings.
Since
Archicad 27
Member Function Documentation
◆ GetGuid()
 GS::Guid ACAPI::v1::DesignOptionCombination::GetGuid  |  ( |   | ) |   const
Returns
The guid of the combination.
◆ GetName()
 GS::UniString ACAPI::v1::DesignOptionCombination::GetName  |  ( |   | ) |   const
Returns
The name of the combination.
Friends And Related Symbol Documentation
◆ DesignOptionManager
 friend class DesignOptionManager
friend
◆ Impl::DesignOptionCombinationViewSettingsImpl
 friend class Impl::DesignOptionCombinationViewSettingsImpl
friend